<?php
if(($_SERVER['HTTP_X_REQUESTED_WITH'] != 'XMLHttpRequest' && !$_REQUEST['action']) || $modx->context->get('key') == "mgr"){return '';}
//if (){return '';}
header('Access-Control-Allow-Origin: *');
$res = array('success' => true, 'message' => '');
if (!$tabSaver = $modx->getService('tabsaver', 'tabSaver', $modx->getOption('tabsaver_core_path', null, $modx->getOption('core_path') . 'components/tabsaver/') . 'model/tabsaver/', array())) {
	return 'Could not load tabSaver class!';
}
switch ($_REQUEST['action']) {
	case 'helloWorld':
		$res['html'] = 'Hello World!';
		break;
    	case 'app':
            $res['version'] = '0.1.1';
    	    if (isset($_REQUEST['version']) && $_REQUEST['version'] && $_REQUEST['version'] == $res['version']) {
    	        $res['code'] = 304;
    	        $res['message'] = '304 Not modified';
    	    } else {
                $res['appName'] = 'Offline Pages';
                $res['phone'] = '+74995068361';
                $res['phone_formated'] = '+7 (499) 506-83-61';
                $res['start'] = '<h3 style="text-align: center; margin: 15px 0 8px;">Наркологическая клиника</h3><h2 style="text-align: center;">«Триессто»</h2>
                <span data-href="tel:'.$res['phone'].'" class="btn btn-positive btn-block external-link" style="margin: 20px 0 25px;">Позвонить</span>
                <p class="center">Анонимная наркологическая помощь&nbsp;круглосуточно!</p>
                <p class="center">Работа с родственниками зависимого, полный&nbsp;курс выздоровления,<br>
                выездная группа по&nbsp;мотивационной работе,<br> сотрудничество с&nbsp;лучшими
                центрами<br> социальной реабилитации в&nbsp;стране.</p>
                <h2 style="text-align: center; margin: 25px 0 8px;"><span>'.$res['phone_formated'].'</span></h2>
                <h3 style="text-align: center; margin: 25px 0 8px;">
                        <span data-href="'.$modx->getOption('site_url').'" class="external-link link">
                          '.str_replace('/','',str_replace('http://','',$modx->getOption('site_url'))).'
                        </span>
                </h3>';
                $res['treatment'] = '<p>Проблема наркозависимости – одна из главных в нашей стране. Количество зависимых увеличивается, появляются новые наркотики, еще страшнее и опаснее предыдущих. Застраховать себя от появления в семье наркомана невозможно! Но не нужно опускать рук, если Ваш родственник попал в сети наркозависимости. Выход их ситуации существует!</p>
                            <p>Наш центр поможет Вам избавиться от наркозависимости! Мы круглосуточно дежурим по номеру телефона горячей линии, чтобы в самый ответственный момент помочь Вам и Вашим близким. Полноценное лечение наркомании, включающее в себя наркологическое лечение и реабилитацию, даст длительный и стойкий результат.</p>
                            <p>Почему именно мы:</p>
                            <p>&mdash; анонимное лечение реабилитация;</p>
                            <p>&mdash; круглосуточная помощь зависимым;</p>
                            <p>&mdash; комфортные условия пребывания во время лечения и реабилитации;</p>
                            <p>&mdash; индивидуальный подход к Вашей проблеме;</p>
                            <p>&mdash; полное сопровождение с момента первой консультации нарколога и по завершению социальной адаптации;</p>
                            <p>&mdash; использование всестороннего лечения.</p>
                            <p>Откладывать лечение наркомании бессмысленно! Вылечить зависимость своими силами невозможно, так же как и отказаться на длительное время от наркотиков самостоятельно. Обращайтесь в наш центр прямо сейчас! Мы гарантируем результат!</p>';
                $res['stages'] = '<h3>Детокс</h3>
                            <p>Детоксикация является первостепенной задачей. Ведь ее функция – очистить Ваш организм от наркотиков и восстановить его работу после отравления. Очищение организма проводится в нашей клинике и назначается индивидуально. Мы оказываем анонимные наркологические услуги! Обращайтесь!</p>
                            <h3>Реабилитационный курс</h3>
                            <p>Курс реабилитации – второе, но не менее важное звено в полноценном выздоровлении. Без реабилитации лечение нельзя назвать завершенным, ведь Вы все равно будете иметь тягу к наркотикам. Реабилитационный курс, пройденный в нашем центре, поможет избежать срыва и укрепить желание жить трезвой и полноценной жизнью.</p>
                            <h3>Социальная адаптация</h3>
                            <p>После выпуска из реабилитационного центра, Вы возвращаетесь домой, в мир, где не будет круглосуточного наблюдения за Вами и такой сильной поддержки, как во время реабилитации. Но мы не бросим Вас! Социальная адаптация – амбулаторная программа, которая включает в себя консультации со специалистами и посещения собраний в реабилитационном центре в любое удобное для Вас время. Мы поможем Вам в любой трудной ситуации!</p>';
                $res['help'] = '<p>Созависимость – это опасное состояние, в которое попадают родственники наркозависимого человека, потакая его заболеванию, решая его проблемы или, еще хуже – начиная употреблять наркотики вместе с ним. Попасть в созависимость легко, ведь люди не знают, как правильно себя вести с зависимым. Мы поможем Вам и Вашему близкому человеку, зависимому от наркотиков! Звоните прямо сейчас!</p>
                        <p>С созависимостью необходимо бороться также, как и с зависимостью. Зачастую родственники наркомана не предпринимают никаких попыток, чтобы измениться самим, изменить свое поведение и отношение к больному. Результатом становится полное отсутствие доверия к человеку после лечения и реабилитации. Это негативно сказывается на выздоровлении.</p>
                        <p>Мы поможем Вам наладить отношения с близким человеком! В нашем центре проводятся специальные собрания для родственников зависимых, которые Вы имеете возможность посещать в любое удобное для Вас время. На встречах присутствует психолог, который помогает правильно построить отношения с выпускником реабилитационного центра. С помощью таких собраний восстановить мирные и дружеские отношения в семье становится гораздо легче! Кроме того, на встречах Вы общаетесь не только со специалистом, но и с другими участниками – такими же как и Вы родственниками, попавшими в трудную ситуацию. Взаимный обмен опытом, взаимопомощь и поддержка помогает настроиться на позитивный лад и понять чувства и эмоции родного человека, находящегося на реабилитации.</p>';
                $res['dontwant'] = '<p>Если Ваш близкий отказывается от лечения, не верит в его эффективность, не понимает свою проблему – не опускайте рук! Причиной отказа от лечения и реабилитации может быть что угодно. Но Вы не должны поддаваться на уговоры зависимого человека и его обещания, так как он все равно не сдержит ни единого слова. Мы поможем Вам уговорить лечиться наркомана!</p>
                            <p>Обратившись к нам, Вы назначаете встречу с нашими специалистами. Команда профессионалов приедет в назначенное время по названному адресу. Психологи мотивируют на лечение Вашего близкого человека! Мы не применяем в убеждении физической силы – мы помогаем открыть глаза на наркоманию и принять единственно верное решение – начать лечение наркозависимости. Обращайтесь к нам прямо сейчас!</p>';
                /*$res['services'] = '';*/
                $res['signes'] = '<p>Есть сомнения по поводу образа жизни Вашего близкого человека? Подозреваете его в том, что он употребляет наркотики? Не знаете, какие признаки бывают у наркомании? Мы Вам поможем!</p>
                        <p>Основные признаки наркозависимости:</p>
                        <p>- регулярное недомогание, болезненный вид (кожа бледная, повышенная температура, проблемы с артериальным давлением, насморк и кашель без других признаков простуды, появление на теле язв или ран без всякой на то причины);</p>
                        <p>- чрезмерно быстрая смена настроения (перепады, не сопоставимые с жизненными событиями в определенный момент);</p>
                        <p>- изменение питания (потеря аппетита, постоянный голод, внезапно появившаяся тяга к определенным продуктам);</p>
                        <p>- замкнутость человека, попытки отгородиться от внешнего мира (молчаливость, балахоны, замок на комнате);</p>
                        <p>- появление следов уколов, странных предметов в доме (обгоревшие чайные ложки, большое количество фольги, непонятные таблетки без упаковки, свертки и коробки с неизвестным содержимым).</p>
                        <p>Если Вы обнаружили у своего близкого человека несколько признаков из выше перечисленных, то Вам нужна очная консультация нарколога. Позвонив нам, Вы получите квалифицированную и анонимную помощь специалистов! Лучше начать лечение как можно раньше, чтобы избежать фатальных последствий наркозависимости. </p>
                        <p>Что НЕ нужно делать:</p>
                        <p>- решать проблемы наркомана (возвращать его долги, давать деньги на наркотики);</p>
                        <p>- осуждать и обвинять (наркоман потеряет остатки доверия к Вам и вообще перестанет слушать);</p>
                        <p>- уговаривать бросить наркотики самостоятельно (обычно наркоман поддерживает эту инициативу, но все равно не выполняет своих обещаний);</p>
                        <p>- держать наркомана взаперти, чтобы избавить его от зависимости, ведь без правильной мотивации близкий не откажется от наркотиков.</p>
                        <p>Мы мотивируем на лечение, проводим анонимную наркологическую терапию, реабилитацию по завершению лечения. Звоните! Мы круглосуточно Вам поможем!</p>';
                $res['contacts'] = $res['start'];
                $res['order-a-call'] = '<div id="callme">
                  <input type="text" placeholder="Ваше имя" id="callme-name">
                  <input type="tel" placeholder="Телефон" id="callme-phone">
                  <textarea rows="5" id="callme-message"></textarea>
                  <span class="btn btn-positive btn-block">Перезвоните мне</span>
                </div>
                ';
                $res['menu'] = array(
                                array(
                                        'id' => 'treatment',
                                        'caption' => 'Лечение',
                                ),
                                array(
                                        'id' => 'stages',
                                        'caption' => 'Этапы',
                                ),
                                array(
                                        'id' => 'help',
                                        'caption' => 'Помощь родным',
                                ),
                                array(
                                        'id' => 'dontwant',
                                        'caption' => 'Не хочет лечиться',
                                ),
                                array(
                                        'id' => 'signes',
                                        'caption' => 'Признаки употребления',
                                ),
                                /*array(
                                        'id' => 'services',
                                        'caption' => 'Услуги и цены',
                                ),*/
                                array(
                                        'id' => 'contacts',
                                        'caption' => 'Контакты',
                                ),
                                array(
                                        'id' => 'order-a-call',
                                        'caption' => 'Заказать звонок',
                                        'class' => 'btn btn-negative btn-block',
                                ),
                                array(
                                        'id' => 'call',
                                        'caption' => 'Позвонить',
                                        'class' => 'btn btn-positive btn-block',
                                        'onclick' => 'app.openURL("tel:'.$res['phone'].'");',
                                )
                        );
    	    }
			break;
	default:
            $response = $modx->runProcessor('tab/create', array('url' => $_POST['url']), array('processors_path' => $modx->getOption('core_path').'components/tabsaver/processors/mgr/'));
            if (!$response->response['object']) {
                $res['html'] = "";
                $res['success'] = false;
            } else {
                if (!$response->response['object']['img']) $response->response['object']['img'] = "";
                $res['html'] = $modx->getChunk('tpl.tabSaverTab', $response->response['object']);
            }
            break;
}
unset($_REQUEST['q']);
unset($_REQUEST['modx_setup_language']);
unset($_REQUEST['PHPSESSID']);
$output = $modx->toJSON(array_merge($_REQUEST,$res));
if (1 == $_REQUEST['debug']) {
$output = '<html><head>'
    . '<style>body { white-space: pre; font-family: monospace; }</style>'
    . '</head><body>'
    . '<script>var obj = '.$output.'; document.body.innerHTML = ""; document.body.appendChild(document.createTextNode(JSON.stringify(obj, null, 4)));</script>'
    . '</body></html>';
}

@session_write_close();
exit($output);